uhnp/src/Catalogs/ПоказателиОтчетов/ПоказателиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоказателиОтчетов</name>
  <owners>Catalog.ВидыОтчетов</owners>
  <owners>Catalog.ШаблоныТрансформационныхКорректировок</owners>
  <attributes>
    <name>ВидИтога</name>
    <type>
      <types>EnumRef.ВидыИтоговПоказателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКурса</name>
    <type>
      <types>EnumRef.ВидыКурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоказателя</name>
    <type>
      <types>EnumRef.ВидыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутриГрупповой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаРаскрытия</name>
    <type>
      <types>CatalogRef.ГруппыРаскрытия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействияПриАктуализации</name>
    <type>
      <types>EnumRef.ДействияПриАктуализацииБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Колонка</name>
    <type>
      <types>CatalogRef.КолонкиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НеМасштабируется</name>
    <comment>Точность отображения показателя не зависит от точности отображения документа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеФинансовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаПоложительногоОтклонения</name>
    <type>
      <types>EnumRef.ВидыОценокОтклонений</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйПоказатель</name>
    <type>
      <types>CatalogRef.ПоказателиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОбработки</name>
    <type>
      <types>EnumRef.СпособыОбработкиПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходовИРасходов</name>
    <type>
      <types>CatalogRef.СтатьиДоходовИРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Строка</name>
    <type>
      <types>CatalogRef.СтрокиОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуффиксКода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>EnumRef.ТипыЗначенийПоказателейОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойПоказатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетБД</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИтогаПоСчету</name>
    <type>
      <types>EnumRef.ВидыБухгалтерскихИтогов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетБД</name>
    <type>
      <types>CatalogRef.СчетаБД</types>
    </type>
  </attributes>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсРегистра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проверочный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокУстранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньКритичности</name>
    <type>
      <types>EnumRef.УровниКритичностиКонтрольныхСоотношений</types>
    </type>
  </attributes>
  <attributes>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияРесурсов</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияРесурсов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляОтраженияКурсовыхРазниц</name>
    <comment>//Удалить</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделениеПоПроектам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПересчитыватьВалютнуюСумму</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Защищенный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентТР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормализованныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоказателя</name>
    <type>
      <types>CatalogRef.ТипыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаИтогаПоПериоду</name>
    <type>
      <types>EnumRef.ВидыИтоговПоказателяПоПериоду</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСуммируется</name>
    <comment>Не суммируется при консолидации / свертке значений</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролируемыйПоказатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <comment>Наименование на дополнительном языке 1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <comment>Наименование на дополнительном языке 2</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_КонтролироватьЛимиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстаточныйПоказатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитываетсяПослеКонвертации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоказателиДляКурсовВалют</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоказательКурса</name>
      <type>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Enums/ТипыЗначенийПоказателейОтчетов/ТипыЗначенийПоказателейОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗначенийПоказателейОтчетов</name>
  <enumValues>
    <name>Число</name>
  </enumValues>
  <enumValues>
    <name>Строка</name>
  </enumValues>
  <enumValues>
    <name>Дата</name>
  </enumValues>
  <enumValues>
    <name>Булево</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ПредназначенияЭлементовСтруктурыОтчета/ПредназначенияЭлементовСтруктурыОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПредназначенияЭлементовСтруктурыОтчета</name>
  <enumValues>
    <name>ПроизвольныеДанные</name>
  </enumValues>
  <enumValues>
    <name>ОборотноСальдоваяВедомость</name>
  </enumValues>
  <enumValues>
    <name>БюджетДвиженияДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>БюджетДоходовИРасходов</name>
  </enumValues>
  <enumValues>
    <name>БюджетДвиженияРесурсов</name>
  </enumValues>
  <enumValues>
    <name>ТрансформационныеКорректировки</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыИтоговПоказателяПоПериоду/ВидыИтоговПоказателяПоПериоду.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыИтоговПоказателяПоПериоду</name>
  <enumValues>
    <name>Сумма</name>
  </enumValues>
  <enumValues>
    <name>Остаток</name>
  </enumValues>
  <enumValues>
    <name>НеРассчитывать</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/ПоказателиОтчетов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьНаименованиеПоказателя(ПоказательОбъект)
	
	ТекстНаименования = НСтр("ru = 'Дт: %1, Кт: %2.'");
	ТекстНаименования = СтрШаблон(ТекстНаименования,
		                        ПоказательОбъект.СчетБД,
		                        ПоказательОбъект.КоррСчетБД);
								
	Если ЗначениеЗаполнено(ПоказательОбъект.РесурсРегистра) Тогда
		
		ТекстНаименования=ТекстНаименования+", "+ПоказательОбъект.РесурсРегистра;
		
	КонецЕсли;
	
	Возврат ТекстНаименования;
		
КонецФункции // ОбновитьНаименованиеПоказателя() 

Процедура ИзменитьОбъектПоПараметрам(СтруктураПараметров,Отказ=Ложь) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураПараметров.Ссылка) Тогда
		
		ПоказательОбъект=Справочники.ПоказателиОтчетов.СоздатьЭлемент();
		ПоказательОбъект.ТипЗначения=Перечисления.ТипыЗначенийПоказателейОтчетов.Число;
		ПоказательОбъект.ЧисловойПоказатель=Истина;
		ЗаполнитьЗначенияСвойств(ПоказательОбъект,СтруктураПараметров,,"Ссылка");
		
		Если СтруктураПараметров.Свойство("КоррСчетБД") Тогда
			
			ПоказательОбъект.Предназначение	= Перечисления.ПредназначенияЭлементовСтруктурыОтчета.ТрансформационныеКорректировки;
			ПоказательОбъект.Наименование=ПолучитьНаименованиеПоказателя(ПоказательОбъект);
								
		ИначеЕсли СтруктураПараметров.Свойство("СчетБД") Тогда
			
			ПоказательОбъект.Предназначение = Перечисления.ПредназначенияЭлементовСтруктурыОтчета.ОборотноСальдоваяВедомость;
			ПоказательОбъект.Код			= ОбщегоНазначенияУХ.ПолучитьВозможныйКодСправочника(СокрЛП(ОбщегоНазначенияУХ.ВернутьАлфавитноЦифровоеПредставление(""+ПоказательОбъект.ВидИтогаПоСчету+СокрЛП(ПоказательОбъект.СчетБД.Код))),Метаданные.Справочники.ПоказателиОтчетов.ДлинаКода,"ПоказателиОтчетов",ПоказательОбъект.Владелец);
			ПоказательОбъект.Наименование	= ""+ПоказательОбъект.ВидИтогаПоСчету+ПоказательОбъект.СчетБД.Код;
	
		Иначе
			
			ПоказательОбъект.Предназначение=Перечисления.ПредназначенияЭлементовСтруктурыОтчета.ПроизвольныеДанные;
			
		КонецЕсли;
	
	Иначе
		
		ИзмененПоказатель=Ложь;
		ПоказательОбъект=СтруктураПараметров.Ссылка.ПолучитьОбъект();
		
		Для Каждого КлючИЗначение ИЗ СтруктураПараметров Цикл
			
			Если НЕ ПоказательОбъект[КлючИЗначение.Ключ]=КлючИЗначение.Значение Тогда
				
				ПоказательОбъект[КлючИЗначение.Ключ]=КлючИЗначение.Значение;
				ИзмененПоказатель=Истина;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПоказательОбъект.Предназначение	= Перечисления.ПредназначенияЭлементовСтруктурыОтчета.ТрансформационныеКорректировки Тогда
			
			ТекстНаименования=ПолучитьНаименованиеПоказателя(ПоказательОбъект);
			
			Если НЕ ПоказательОбъект.Наименование=ТекстНаименования Тогда
				
				ПоказательОбъект.Наименование=ТекстНаименования;
				ИзмененПоказатель=Истина;

			КонецЕсли;		
				
		КонецЕсли;

		Если НЕ ИзмененПоказатель Тогда
			
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураПараметров.Свойство("СчетБД") Тогда
		
		ПоказательОбъект.ГруппаРаскрытия=Справочники.ВидыОтчетов.ПолучитьГруппуРаскрытияДляСчета(ПоказательОбъект.Владелец,
						ПоказательОбъект.СчетБД,
						?(СтруктураПараметров.Свойство("КоррсчетБД"),		ПоказательОбъект.КоррСчетБД,Неопределено),
						?(СтруктураПараметров.Свойство("ВидИтогаПоСчету"),	ПоказательОбъект.ВидИтогаПоСчету,Неопределено));
			
	КонецЕсли;
	
	Попытка
		
		ПоказательОбъект.ПолучитьКодПроводки();		
		
		ПоказательОбъект.ОбменДанными.Загрузка=Истина;
		ПоказательОбъект.Записать();
		СтруктураПараметров.Вставить("Ссылка",ПоказательОбъект.Ссылка);
		
	Исключение
		
		СтрокаШаблона = Нстр("ru = 'Не удалось обработать показатель %1: %2'");
		
		Если Не ПустаяСтрока(СтрокаШаблона) тогда
			ОбщегоНазначенияУХ.СообщитьОбОшибке(СтрШаблон(СтрокаШаблона, ПоказательОбъект.Наименование, ОписаниеОшибки()), Отказ,, СтатусСообщения.Важное);
		КонецЕсли;
		
		Отказ = Истина;
		
	КонецПопытки;
		
КонецПроцедуры // ИзменитьОбъектПоПараметрам()

// Сравнивает значения Реквизит1Вход и Реквизит2Вход. В случае их различия -
// устанавливает параметр ЕстьРазличияИзм в истина. В противном случае -
// оставляет параметр в исходном виде.
Процедура СравнитьРеквизиты(Реквизит1Вход, Реквизит2Вход, ЕстьРазличияИзм)
	Если Реквизит1Вход <> Реквизит2Вход Тогда
		ЕстьРазличияИзм = Истина;
	Иначе
		// Выполняем проверку далее.
	КонецЕсли;
КонецПроцедуры		// СравнитьРеквизиты()

// Формирует и возвращает пустую структуру данных лимитрования показателя.
Функция СформироватьСтруктуруДанныхЛимитированияПоказателя() Экспорт
	
	СправочникБДР="СтатьиДоходовИРасходов";

	РезультатФункции = Новый Структура;
	РезультатФункции.Вставить("Предназначение",					 Перечисления.ПредназначенияЭлементовСтруктурыОтчета.ПустаяСсылка());
	РезультатФункции.Вставить("СтатьяДвиженияДенежныхСредств",	 Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());
	РезультатФункции.Вставить("СтатьяДоходовИРасходов",			 Справочники[СправочникБДР].ПустаяСсылка());
	РезультатФункции.Вставить("Показатель",						 Справочники.ПоказателиОтчетов.ПустаяСсылка());
	Возврат РезультатФункции;
КонецФункции		// СформироватьСтруктуруДанныхЛимитированияПоказателя()

// Проверяет правильность заполнения лимитирующих реквизитов, заданных в
// структуре ДанныеЛимитированияПоказателяВход.
Функция ПроверитьЛимитирующиеРеквизитыПоказателя(ДанныеЛимитированияПоказателяВход) Экспорт
	
	СправочникБДР="СтатьиДоходовИРасходов";
	
	// Инициализация.
	РезультатФункции = Истина;
	Предназначение					 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЛимитированияПоказателяВход, "Предназначение", Перечисления.ПредназначенияЭлементовСтруктурыОтчета.ПустаяСсылка());
	СтатьяДвиженияДенежныхСредств	 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЛимитированияПоказателяВход, "СтатьяДвиженияДенежныхСредств", Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());
	СтатьяДоходовИРасходов			 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЛимитированияПоказателяВход, "СтатьяДоходовИРасходов", Справочники[СправочникБДР].ПустаяСсылка());
	Показатель						 = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЛимитированияПоказателяВход, "Показатель", Справочники.ПоказателиОтчетов.ПустаяСсылка());
	ПредназначениеБюджетДвиженияДенежныхСредств	 = (Предназначение = Перечисления.ПредназначенияЭлементовСтруктурыОтчета.БюджетДвиженияДенежныхСредств);
	ПредназначениеБюджетДоходовИРасходов		 = (Предназначение = Перечисления.ПредназначенияЭлементовСтруктурыОтчета.БюджетДоходовИРасходов);
	ЗаполненаСтатьяДвиженияДенежныхСредств	 = ЗначениеЗаполнено(СтатьяДвиженияДенежныхСредств);
	ЗаполненаСтатьяДоходовИРасходов			 = ЗначениеЗаполнено(СтатьяДоходовИРасходов);
	// Проверка корректности Статьи ДДС.
	Если ЗаполненаСтатьяДвиженияДенежныхСредств Тогда
		ЗаполнениеКорректно = ((ПредназначениеБюджетДвиженияДенежныхСредств) И (НЕ ЗаполненаСтатьяДоходовИРасходов) );
		Если НЕ ЗаполнениеКорректно Тогда
			ТекстСообщения = НСтр("ru = 'В показателе ""%Показатель%"" неверно заполнены реквизиты по бюджету движения денежных средств'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Показатель%", Строка(Показатель));
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			РезультатФункции = Ложь;
		Иначе
			// Проверка пройдена успешно. Продолжаем.
		КонецЕсли;
	Иначе
		// Нет статьи ДДС. Пропускаем проверку.
	КонецЕсли;
	// Проверка корректности Статьи БДР.
	Если ЗаполненаСтатьяДоходовИРасходов Тогда
		ЗаполнениеКорректно = ((ПредназначениеБюджетДоходовИРасходов) И (НЕ ЗаполненаСтатьяДвиженияДенежныхСредств) );
		Если НЕ ЗаполнениеКорректно Тогда
			ТекстСообщения = НСтр("ru = 'В показателе ""%Показатель%"" неверно заполнены реквизиты по бюджету доходов и расходов'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Показатель%", Строка(Показатель));
			ОбщегоНазначенияУХ.СообщитьОбОшибке(ТекстСообщения);
			РезультатФункции = Ложь;
		Иначе
			// Проверка пройдена успешно. Продолжаем.
		КонецЕсли;
	Иначе
		// Нет статьи БДР. Пропускаем проверку.
	КонецЕсли;
	Возврат РезультатФункции;
КонецФункции		// ПроверитьЛимитирующиеРеквизитыПоказателя()

&НаСервере
Процедура УстановитьПризнакиОстаточныхПоказателей() Экспорт
	

   Запрос = Новый Запрос;
   Запрос.Текст = "ВЫБРАТЬ
   |	ПоказателиОтчетов.Ссылка КАК Ссылка
   |ИЗ
   |	Справочник.ПоказателиОтчетов КАК ПоказателиОтчетов
   |ГДЕ
   |	ПоказателиОтчетов.СпособРасчетаИтогаПоПериоду = &СпособРасчетаИтогаПоПериоду";
   
   Запрос.УстановитьПараметр("СпособРасчетаИтогаПоПериоду",Перечисления.ВидыИтоговПоказателяПоПериоду.Остаток);
   
   Результат = Запрос.Выполнить();
   Выборка = Результат.Выбрать();
   
   Пока Выборка.Следующий() Цикл
   
	    ПоказательОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПоказательОбъект.ОстаточныйПоказатель =Истина;
		ПоказательОбъект.ОбменДанными.Загрузка = Истина;
		ПоказательОбъект.Записать();
   
   КонецЦикла;
  

КонецПроцедуры



#КонецЕсли
